Documents/ESB/ESB_Consumer_0731/003TestSample/SAMPLE_XML_MUST/Loan/LO29_AcctStlSchdModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Loan/AcctStlSchdModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Loan</ServiceDomain>  
      <OperationName>AcctStlSchdMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:AcctStlSchdModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LO29</v11:TxnId>  
        <v11:TxnNo>LO2900001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <v11:ArrngId>NEW</v11:ArrngId>  
          <v11:EffDate>STR</v11:EffDate> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:AcctStlSchdModRq> 
  </soap:Body> 
</soap:Envelope>
